; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 474882 1 1 4 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon7 spectrograph3)
	(have_image Phenomenon8 infrared1)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 spectrograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star3 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star3)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 6
7. (take_image satellite0 phenomenon8 instrument0 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 3 of 6
8. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon7 instrument0 spectrograph3)
   added: (have_image phenomenon7 spectrograph3)
   goals met: 3 of 6
10. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 6
11. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 6
12. (take_image satellite0 phenomenon6 instrument0 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 4 of 6
13. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 6
14. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
15. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 6
16. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 6
